## Messages
start_message = "Привет, студент! Уверен, что достоин называться айтишником? Есть ли у тебя достаточно логического " \
                "мышления и профессиональных знаний, чтобы доказать это? Давай проверим... "

hints = ["Итак, начнем. Алексей проголодался и пошел за сникерсом",
"Сеня с Таном любят поесть и поиграть в настольный теннис, но ненавидят лестницы",
"В кабинете под номером 3(а может 2 или 4, мы до сих пор не знаем) живет любитель CTFa и других "
"прикольных соревнований из мира технологий. Возможно, у него есть то, что тебе нужно.",
"Найди его в колледже https://www.instagram.com/dekocsoff/ и получишь заветную последнюю подсказку."
]

flags = ['1', '2', '3', '4']


final = "Поздравляю, ты собрал все паскалки и теперь можешь считать себя достоиным. Забрать свой приз можешь у него " \
        "же. Если ты любишь решать загадки и готов продемонстрировать всем свои навыки, то вступай к нам: " \
        "https://t.me/+Cm5I6cCpVS80M2Iy "

## Values
LAST_STAGE = 5
admins = []
