## Messages
start_message = "Привет, студент!\nГотов ли ты решить нашу загадку?"


hints = ["Итак, начнем. \n\nАлексей — главный любитель сникерсов во всём колледже. \nОн должен был оставить для тебя подсказку, но только где она — никому не сказал. \nБудет обидно, если её никто не найдет. ",
"А ты внимательный! \nСледующую подсказку должны были оставить Сеня и Тан, которые обожают играть в настольный теннис после обеда. \nРазберёшься, где искать?",
"В главном логове всех ИБшников колледжа живет любитель CTFa и други прикольных соревнований из мира технологий. \nМожет он даст тебе подсказку?",
"Ого! \nТебе всё-таки удалось пройти его испытание??? \nЧто ж, поздравляю, ты на финишной прямой! \nТебе осталось лишь найти его (https://www.instagram.com/dekocsoff/) в колледже, чтобы получить заветную последнюю подсказку."
]

flags = ['1', '2', '3', '4']


final = "Поздравляю! \nТебе удалось собрать все подсказки и теперь ты можешь считать себя достойным. \nЗабрать свой приз можешь у него же. \n\nА если хочешь и дальше решать загадки, то вступай к нам:\n https://t.me/+Cm5I6cCpVS80M2Iy"

wrong_flag = "Я тебя не понимаю :( \nТы точно нашел подходящий qr-код?"

incorrect_start = "Привет! :) \nТы нашел одну из подсказок для решения нашей загадки. \n\nЕсли хочешь поучаствовать в нашем квесте, то найди QR-код у входа (ты точно его заметишь)."


## Values
LAST_STAGE = 4
admins = []
