## Messages
start_message = "Привет, студент! Уверен, что достоин называться айтишником? Есть ли у тебя достаточно логического " \
                "мышления и профессиональных знаний, чтобы доказать это? Давай проверим... "

hint_for_code_1 = """Итак, начнем. Алексей проголодался и пошел за сникерсом"""
hint_for_code_2 = """Сеня с Султаном любят поесть и поиграть в настольный теннис, но ненавидят лестницы"""
hint_for_code_3 = """В кабинете под номером 3(а может 2 или 4, мы до сих пор не знаем) живет любитель CTFa и други прикольных соревнований из мира технологий."""
hint_for_code_4 = """Найди его в колледже https://www.instagram.com/dekocsoff/ и получишь заветную последнюю подсказку."""
...

final_message = """Поздравляю, ты собрал все паскалки и теперь можешь считать себя достоиным. Заберать свой приз можешь у него же. А если хочешь больше подобного контента, то вступай к нам: https://t.me/+Cm5I6cCpVS80M2Iy"""

## Values
LAST_STAGE = 6
admins = []
