us_finished_simple = "Поздравляю! \nТебе удалось собрать все подсказки и теперь ты можешь считать себя достойным. \nЗабрать свой " \
        "приз можешь у него же. \n\nА если хочешь и дальше решать загадки, то вступай к нам:\n " \
        "https://t.me/+Cm5I6cCpVS80M2Iy "

us_finished_advanced = 'us_finished_advanced'

us_wrong_flag = "Я тебя не понимаю :( \nТы точно нашел подходящий qr-код?"

us_no_such_user = "Привет! :) \nТы нашел одну из подсказок для решения нашей загадки. \n\nЕсли хочешь поучаствовать в " \
                  "нашем квесте, то найди QR-код у входа (ты точно его заметишь). "
us_start_message = "Привет, студент!\nГотов ли ты решить нашу загадку?"

us_rules = "Для начала запомни правила: \n\n1. Побеждает быстрейший. \nКоличество призовых мест ограничено — хорошенько " \
        "подумай перед тем, как делиться с кем-то своей находкой ;-) \n2. Хорошо лежит — не трогай. \nВсё, " \
        "что найдешь в ходе квеста, оставляй в неизменном виде. \nМы за честную игру. \n3. Веселись :-) "

us_how_to_play = "Как играть:\nДля прохождения квеста необходимо найти все QR-коды, спрятанные в колледже.\nНайденный " \
              "ключ отправляйте боту — он подскажет, где искать дальше.\n\n\nЕсли вы считаете, что что-то работает не " \
              "так, как надо — пишите: @wazzzy "

us_already_finished_simple = 'already finished simple'

us_already_finished_advanced = 'already finished advanced'

us_final_simple = 'us_final_simple'

us_final_advanced = 'us_final_advanced'



ad_send_all = 'Сообщение для всех пользователей от {username}:\n{msg}'

ad_send_user = 'Сообщение для {username}({user_id}) от {sender}:\n{msg}'

ad_new_user = 'Пользователь {username} ({user_id}) присоединился к игре!'

ad_no_such_user = '!WARNING! Пользователь {username} ({user_id}) написал {msg}, но его нет в базе!'

ad_already_finished = 'Пользователь {username} ({user_id}) закончил основной этап, но еще не начал дополнительный. Его сообщение - "{msg}".'

ad_wrong_flag = 'Пользователь {username} ({user_id}) ввел неправильный флаг ({msg}).'

ad_finished_simple = '#FIN Пользователь {username} ({user_id}) ввел флаг "{msg}" и завершил основную часть.'

ad_finished_advanced = '#FIN_ad Пользователь {username} ({user_id}) ввел флаг "{msg}" и завершил дополнительную часть.'

ad_set_advanced = 'Пользователь {username} ({user_id}) приступил к дополнительной части квеста.'

ad_flag_correct = 'Пользователь {username} ({user_id}) ввел правильный флаг ({msg}) и переходит к {stage} этапу'
