us_finished_simple = "Прими наши поздравления! \nТы прошел основную часть квеста и заслужил свою награду :-)\nЧтобы получить приз свяжись с @tan_t1tan или @wazzzy \n\nА если хочешь и дальше решать загадки, то вступай к нам:\nhttps://t.me/+Cm5I6cCpVS80M2Iy\n\n\nP.S.Ты также можешь получить больше призов, если решишь загадку повышенной сложности ;-)"
us_finished_advanced = "Поразительно! \nТвои усилия достойны высшей похвалы!\n\nТеперь ты можешь забрать свою заслуженную особую награду!\nЧтобы получить приз свяжись с @tan_t1tan или @wazzzy\n\n\nP.S. не забудь вступить в нашу беседу:\nhttps://t.me/+Cm5I6cCpVS80M2Iy"

us_wrong_flag = "Я тебя не понимаю :( \n\nТы точно нашел подходящий qr-код?"

us_no_such_user = "Привет! :) \nТы нашел одну из подсказок для решения нашей загадки. \n\nЕсли хочешь поучаствовать в " \
                  "нашем квесте, то найди QR-код у входа (ты точно его заметишь). "

us_start_message = "Привет, студент! \n\nМожет, ты уже знаком с нами, а может раньше мы и не встречались, но ты точно найдёшь здесь кое-что интересное. \nПредставляем тебе расширенную версию вчерашнего квеста, в который мы расскажем о всех участниках нашей команды. \n\nГотов ли ты впервые (или вновь...) решить нашу загадку?"

us_rules = "Для начала запомни правила: \n\n1. Побеждает быстрейший. \nКоличество призовых мест ограничено — хорошенько " \
        "подумай перед тем, как делиться с кем-то своей находкой ;-) \n2. Хорошо лежит — не трогай. \nВсё, " \
        "что найдешь в ходе квеста, оставляй в неизменном виде. \nМы за честную игру. \n3. Веселись :-) "

us_how_to_play = "Как играть:\nДля прохождения квеста необходимо найти все QR-коды, спрятанные в колледже.\nНайденный " \
              "ключ отправляйте боту — он подскажет, где искать дальше.\n\n\nЕсли вы считаете, что что-то работает не " \
              "так, как надо — пишите: @wazzzy"

us_already_finished_simple = ""

us_already_finished_advanced = ""

us_start_for_old = "Информация для тех, кто уже проходил наш квест: \n\nНесмотря на то, что вы уже стали финалистами прошлой игры, у вас всё еще остаётся право побороться за призы. \n\nПодробней про призы вы можете узнать у него: @tan_t1tan"



ad_send_all = 'Сообщение для всех пользователей от {username}:\n{msg}'

ad_send_user = 'Сообщение для {username}({user_id}) от {sender}:\n{msg}'

ad_new_user = 'Пользователь {username} ({user_id}) присоединился к игре!'

ad_no_such_user = '!WARNING! Пользователь {username} ({user_id}) написал {msg}, но его нет в базе!'

ad_already_finished_simple = 'Пользователь {username} ({user_id}) закончил основной этап, но еще не начал дополнительный. Его сообщение - "{msg}".'

ad_already_finished_advanced = 'Пользователь {username} ({user_id}) закончил квест. Его сообщение - "{msg}".'

ad_wrong_flag = 'Пользователь {username} ({user_id}) ввел неправильный флаг ({msg}).'

ad_finished_simple = '#FIN Пользователь {username} ({user_id}) (old winner - {ow}) ввел флаг "{msg}" и завершил основную часть.'

ad_finished_advanced = '#FIN_ad Пользователь {username} ({user_id}) (old winner - {ow}) ввел флаг "{msg}" и завершил дополнительную часть.'

ad_set_advanced = 'Пользователь {username} ({user_id}) приступил к дополнительной части квеста.'

ad_flag_correct = 'Пользователь {username} ({user_id}) ввел правильный флаг ({msg}) и переходит к {stage} этапу'

ad_user_stage = 'Пользователь {username} ({user_id}) на {stage} этапе'

ad_old_winner = '{ow}'
