hints = ["Итак, начнем. \n\nАлексей — главный любитель сникерсов во всём колледже. \nОн должен был оставить для тебя подсказку, но только где она — никому не сказал. \nБудет обидно, если её никто не найдет. ",
"А ты внимательный! \nСледующую подсказку должны были оставить Сеня и Тан, которые обожают играть в настольный теннис после обеда. \nРазберёшься, где искать?",
"Согласись, это было непросто. Коленки не болят?) \nВ главном логове всех ИБшников колледжа живет любитель CTFa и других прикольных соревнований из мира технологий. \nМожет он даст тебе следующую подсказку?",
"Ого! \nТебе всё-таки удалось пройти его испытание??? \nЧто ж, поздравляю, ты на финишной прямой! \nТебе осталось лишь найти его (https://www.instagram.com/dekocsoff/) в колледже, чтобы получить заветную последнюю подсказку."
]

flags = ['sn1gg3rs_1s_my_L0vVv3', 'p0SL3_pl0TN0g0_ob3DA', 'v_l0g0v3_ZV3rya', 'curs3D_danYA']