hints = [
    """Начнем?
    
Арсений Мальгинов — одуванчик нашего CTF сада. 
Стеганография — его конёк. Найдёт скрытую информацию даже там, где её не было изначально. 
Помимо всего прочего также человек высокой филосовской мысли.
Где же его QR-код? """,
    """Мы знали, что ты справишься :-) 
Но это только начало ;-)

Ярослав Лисин — человек, который настолько любит учиться, что 6 часов на дорогу в колледж для него сущий пустяк. 
Одно из любимых произведений Ярослава — Властелин Колец. И он, как любой уважающий себя дворф, чаще всего обитает на нижних этажах колледжа.""",
    """Понравилось в обители дворфов?)

Меджидов Султан — главный интернет-детектив нашего коллектива, ничто не способно сбить его с верного пути, если он напал на след. Однако, даже у него есть своя слабость. И это... Ёжики! 
Эти маленькие милые зверьки вызывают у него такую детскую радость, что способны отвлечь его даже от самого интересного дела. 

В этой картинке Тан зашифровал для вас подсказку к следующему QR-коду""",
    """Сложно было?)

Кирилл Кулешов — наш веб. разработчик, который начал увлекаться CTF после того как впервые попробовал взломать сайт, а не создать его. 
Всё было в рамках закона :-) 
Свою подсказку, как истинный веб-разработчик, Киря выгрузил на облако. 
А как иначе?
Кстати, ходит легенда, что верхние этажи нашего колледжа достают прямо до небес.""",
    """А теперь пора спускаться с небес на землю 0-0

Дмитренко Павел Сергеевич — главный любитель CTF движения. 
Сфинкс нашей CTF пирамиды. Правильно ответить на его загадки удавалось лишь немногим. 

Окажешься ли ты в их числе?


P.S. Найти его можно в логове всех ИБ-шников колледжа :-)""",
    """Знатно он тебя помучал...

Михаил Окин — увлекается реверсом. Мечтает стать профессионалом в области информационной безопасности и четко следует правилу, которое когда-то услышал от своего духовного наставника: «ИБ-шник - это подсобная крыса, которая не выходит на свет.»
Духовный наставник Михаила, а также главный ИБ-шник всего колледжа, забрал у Миши QR-код и повесил в коридоре возле своего кабинета.

Найдёте его?""",
    """Как же далеко вы зашли...

Алексей Измодёнов a.k.a Nasty Boy — грациозная лань нашего коллектива. Изумительный танцор, любимчик преподавателей. 
Он должен был подготовить для вас подсказку, но после пары по физической культуре, когда он пытался соблазнить очередную девушку своими танцевальными па, выронил её где-то в окрестностях спортзала.

Такой растяпа ッ""",
    """Ох уж этот дамский угодник...

Данила Мастер (по паспорту Фадеев) — криптограф SSS ранга, жизнерадостный и позитивный парень, готовый зарядить оптимизмом всю команду. 
Предпочитает не хранить QR-коды в открытом виде, поэтому оставил его возле кабинета человека, который разбирается в шифрах лучше всех.""",
    """Раз ты уверен в своих силах, вот тебе последнее задание - http://www.rambler.press/
    
    Удачи ;-)"""
]

flags = ['T0_be_or_n0t_to_b3', 'l0rD_0f_th3_R1ng5', 'hEdg3h0gss_4ev3r', 'T0uc4_tH3_sKY', 'CtF_mAs7er', 'L1ghts_0ff', 'TH3_n6stY_b011', 'CumenniyTSVetokk', 'Very_hard_task']

img = ['0', '0', 'https://ibb.co/4js9M6v', '0', '0', '0', '0', '0', '0']